Shackle3/SAMPLETOY/SAMPLETOY_ESP32_Arduino/src/main.cpp
//mainloop written by fabian, add your name here if you contribute

#include <Arduino.h>
#include <vector>
#include <chrono>
#include <esp32-hal-ledc.h>

extern "C"{ //C header inclusions
    #include "SampletoyUtility.h"
    #include "SampletoyIO.h"
    #include "SampletoyChannel.h"
    #include "SampletoyPlaylist.h"
}

const int DAC_OUT_BUS[] {5, 19, 22, 26, 4, 18, 21, 25}; //@todo remove these, opt for different system wherein information is dealt
// put function declarations here:
SET_LOOP_TASK_STACK_SIZE(16*1024);

namespace SampletoyMain{
    void switchRuntimeLogic();
}

namespace PlayFunctions{
    void generateNextSamplesForSubdivision();
    void generateSampleOntoMasterImplicit();
    void generateTrackSamples(track* target);
}

namespace WriteFunctions{

}

namespace SampletoyIO{

}

namespace SampletoyInterrupts{
    void IRAM_ATTR dacLoadNext();
}

namespace runtimeAssets{
    //debug
    bool first_loop_iteration = true; //debug value used to display a message on the first loop of tests
    int temp_generic = 0;
    bool temp_in_use = false;

    //control variables
    bool loop_mode_play_edit = EDIT; //initialise in edit

    //important, functional, memory allocations
    playlist session_playlist;
    masterchannel session_master_channel;
    // channel sub_channels[TOTAL_CHANNELS]; removed as of implementation of playlist
    upair16 dac_buffer[DAC_BUFFER_SIZE] = {0};
    uint16_t dac_buffer_allocated;
    upair16 dac_port;

}
//@todo LABEL YOUR TESTS IN TERMINAL

//test declarations
namespace tests{
    void mainTestCounterOverDACBus(double timeFactor);
    void mainTestAudioSynthesis();
    void mainTestChannelFunctionalities();
    void mainTestPwmIndependence();
    void IRAM_ATTR mainTestInterruptFunctionality();
    void mainReportInterruptOnPin();
    void mainTestMathSynthesisPipeline();
    void mainTestPlaylistFunctionalities();
    void mainTestPutSineMidiOntoTracks();
}

//debugs, tests that should be removed when doing a release build
namespace debug{
    void DumpChannelData(const Channel *target, uint8_t channel_number);
    void DumpMasterData(const MasterChannel *target);
    bool interrupt_reported = false;
    void debugGenerateNextSamplesForSubdivision();
    void debugGenerateSampleOntoMasterImplicit();
}

void setup() {
    Serial.begin(115200); //setup baud
    Serial.println("Init SAMPLETOY build 0.2, Written by Fabian Lee! Hello Developer and or Hackerman!");
    Serial.println("Running manual crash finding, remove me please");

    //setup DAC output bus
    /*for (uint8_t pin : DAC_OUT_BUS){
        pinMode(pin, OUTPUT);
    } @todo reimplement the following back into code as 2 pin shift register setup*/

        //setup DAC signal
    pinMode(DAC_CLOCK_PIN, OUTPUT);
    Serial.println("i");
    analogWriteFrequency(DAC_CLOCK_FREQ); //initialise interrupt clock
    analogWrite(DAC_CLOCK_PIN, 1); // assign clock
        //setup interrupt reciever pin for sending samples to dac
    Serial.println("ii");
    pinMode(INTERRUPT_PIN_SEND_NEXT_SAMPLE_TO_DAC, INPUT_PULLUP);
    runtimeAssets::dac_buffer_allocated = 0;
    runtimeAssets::dac_port = (upair16){uint16_middle,uint16_middle};
    Serial.println("iii");
    //attach interrupts, set to interrupt when falling signal. Use Pullup across project for consistency
    attachInterrupt(INTERRUPT_PIN_SEND_NEXT_SAMPLE_TO_DAC, SampletoyInterrupts::dacLoadNext, FALLING);
    //Initialise Playlist, and track subchannels
    Serial.println("iv");
    reassignPlaylistInstance(&runtimeAssets::session_playlist); //assign default instance to playlist, no support for further playlists yet
    Serial.println("v");
    reinitialisePlaylist();
    Serial.println("vi");
        //init Master Channel
    masterChannelReinitialise(&runtimeAssets::session_master_channel);
    Serial.println("vii");
    //Initialise IO
    Serial.println("setup finished");
    delay(5000);
}

void realloop() { //Real loop, change name for testloop below
if (runtimeAssets::loop_mode_play_edit){ //true, PLAY environment is playing
//Setup, change values

//Calculate Synth values, update samples

//Sum to master

//Post, cleanup
}
else{ //EDIT environment

//Setup, change values

//Calculate Synth values, update samples

//Sum to master

//Post, cleanup
}
    runtimeAssets::first_loop_iteration = false;
}

void loop(){ //Test loop, a clean small loop that you enter by changing the name of the function. Its bad, i know :(
    // Call whatever test loop you need here, write tests in src and import here
    //Should be inaccessible to realloop
    int total_samples_number = 0;
    if (runtimeAssets::first_loop_iteration){
        tests::mainTestPutSineMidiOntoTracks(); //add even spaced sines
        
    }
    while(total_samples_number < 10){
        debug::debugGenerateNextSamplesForSubdivision();
        total_samples_number++;
    
    }
    runtimeAssets::first_loop_iteration = false;
}


// put function definitions here:
//mititage implementation into this section, to only those which are runtime

namespace SampletoyMain{
    void switchRuntimeLogic(){
        /*
        @brief changes the main loop to go from writing mode to playing mode
        */
        if (runtimeAssets::loop_mode_play_edit){
            runtimeAssets::loop_mode_play_edit = EDIT;
            runtimeAssets::first_loop_iteration = true;
        } else {
            runtimeAssets::loop_mode_play_edit = PLAY;
            runtimeAssets::first_loop_iteration = true;
        }
    }
}

namespace PlayFunctions{
    //write play runtime functions here
    void generateNextSamplesForSubdivision(){ //subdivision level call
        //runtime level sample generation call
        //!IMPORTANT should be called in loop() to batch generate samples for current playhead position, dont use the other sub functions called in this one
            //Preloop
        uint8_t generating_sample_number = 0;
        //generate current active midi events for the subdivision
        for (track track_in_active_playlist : playlist_instance->playlist_tracks){
            trackUpdateActiveMidiEvents(&track_in_active_playlist.track_midi); 
        } //@todo make into generic function in SampletoyPlaylist
        //define samples to generate
        int n_samples_to_generate = recalculateSamplesPerSubdivision(playlistGetBPM());
        while(generating_sample_number < n_samples_to_generate){ //enter the generate loop over n number of samples
            generateSampleOntoMasterImplicit();
            generating_sample_number++;
        } 
        runtimeAssets::session_playlist.playhead_position_subdivision++;
        //debug
        Serial.println("Generated Batch Samples for playhead position");
    }

