Shackle3/SAMPLETOY/SAMPLETOY_ESP32_Arduino/src/main.cpp
    void generateSampleOntoMasterImplicit(){ //should NOT be called in main loop, but instead be called by above function (generateNextSamples...)
        //See documentation page @todo
        //1. Reset Master bus level
        masterResetLevelToMiddle(&runtimeAssets::session_master_channel);
        //2. sample number n is implicitly contained in metadata, call generate onto every track
        for (track track_instance : runtimeAssets::session_playlist.playlist_tracks){
            //call generate onto all tracks for that sample
            generateTrackSamples(&track_instance);            
        }
        //all channels contain audio information, summarising on array (2.iii)
        for (uint8_t i; i < TOTAL_CHANNELS; i++){
            playlist_instance->subchannel_sample_outputs[i] = (upair32){
            playlist_instance->playlist_tracks[i].track_channel.level_left, 
            playlist_instance->playlist_tracks[i].track_channel.level_right
            };
        }
        //3. Sum channel to master
        for (upair32 channel_output : playlist_instance->subchannel_sample_outputs){
            masterAddSignalPair(&runtimeAssets::session_master_channel, channel_output);
        }
        //From here, master is finished calculating
        //freeze until space in buffer @todo ??!?!?!? ugly
        while (runtimeAssets::dac_buffer_allocated > DAC_BUFFER_SIZE){
            continue;
        }
        //add into buffer
        uint16_t temp_left_16bit = downscale_int32_to_int16(runtimeAssets::session_master_channel.level_left);
        uint16_t temp_right_16bit = downscale_int32_to_int16(runtimeAssets::session_master_channel.level_right);
        runtimeAssets::dac_buffer_allocated++;
        runtimeAssets::dac_buffer[runtimeAssets::dac_buffer_allocated] = (upair16){temp_left_16bit, temp_right_16bit};
    }
    
    void generateTrackSamples(track* target){
        /*
        Generates Track Subchannel outputs onto playlist, does NOT push to master!
        */ //@todo link to documentation page
        //isolating member variables into more readable format
        channel* target_channel_pointer = &target->track_channel;
        generator* target_generator_pointer = &target->track_generator;
        miditrack* target_miditrack_pointer = &target->track_midi;
        uint8_t target_track_number = target->track_number; //clone, const so can be ambig
        //implementation following from point 2.ii.a in above linked documentation
        channelResetLevelToMiddle(target_channel_pointer);
        //active midi events calculated in preloop of generateNextSamples...
        //generate each midi event onto channel track using addSignalInput call on channels
        for (midinote midinote_playing : target->track_midi.active_midi_events){
            upair32 lr_signal_container = {0,0};
            //Serial.printf("generating for midi event: %u, %u, %f, %u\n", midinote_playing.length, midinote_playing.midi_code, midinote_playing.phase_position, midinote_playing.point_to);
            lr_signal_container = callGenerateForEvent(target_generator_pointer, midinote_playing.midi_code, &midinote_playing.phase_position);
            //Serial.printf("investigating if synth outputs signal, %u, %u\n", lr_signal_container.int1, lr_signal_container.int2);
            channelAddSynthesizerSignal(target_channel_pointer, lr_signal_container.int1, lr_signal_container.int2);
        }
    }
}

namespace WriteFunctions{
    //write Write runtime functions here
}

namespace SampletoyIO{ //mostly runtime so IO is implemented within main
}

namespace SampletoyInterrupts{
    void IRAM_ATTR dacLoadNext(){
        //placeDacPortOnPins(); //or some shit like this when i actually implement it
    }
}

//Tests definitions #remove in final version
namespace tests {
    void mainTestCounterOverDACBus(double timeFactor) {
        /*
        Somewhat redundant function now, checks that the output pins are truely outputting and unlinked
        */
        //test pinout
        if (runtimeAssets::first_loop_iteration) {
            Serial.println("running test counter over DAC pins, pins show boolean value of a counting uint8 ");
            Serial.println("output pins in LSB to MSB order is 5, 19, 22, 26, 4, 18, 21, 25");
            runtimeAssets::first_loop_iteration = false; // don't display message again
        }
        double blink_interval = 25 * timeFactor;
        placeDacPortOnPins();
        delay(blink_interval);
        //dac_port++;
    }

    void mainTestPwmIndependence(){ 
        /*
        Tests and demonstrates the functionality of analogue write, as well as its code independence.
        */
        analogWriteFrequency(4); //frequency
        analogWrite(DAC_CLOCK_PIN, 1); // pin, scaling factor x
        for(;;){
            Serial.println("code is theoretically frozen on this line! If light is blinking pwm is runtime independent");
        } //runtime independent

    }

    void mainReportInterruptOnPin(){ 
        /*
        Our goal here to to check, that pin PWM signals can trigger interrupts by routing the DAC Clock pin to the DAC interrupt, and
        successfully recieving/performing an interrupt operation.

        Mind you interrupts are finniky, at the moment it reports like thousands of interrupts
        */
        if (runtimeAssets::first_loop_iteration){ //DAC CLOCK blinks every 0.25 seconds.
            //analogWriteFrequency(4);
            Serial.println("first runtime check successful");
        }

        if (debug::interrupt_reported){
            if(runtimeAssets::temp_generic % 44100 == 0){
                Serial.printf("button pressed %u times... \n" , runtimeAssets::temp_generic);
            }
            //Serial.printf("button pressed %u times... \n" , temp_generic);
            debug::interrupt_reported = false;
        }
        //note. THIS WORKS HOLY SHIT YES!!!!

    }

    void mainTestMidiPlaylistDebugSetup1(){
        //Creates sustained note on C4, lasts 1 second on, one second off
    }

    void mainTestMathSynthesisPipeline(){
        //setup midi information
    }

    void mainTestPlaylistFunctionalities(){
            //test 1
        Serial.println("test1: Testing generic empty midi event really is generic empty");
        // create empty event, compare to generic empty, make sure they're the same
        midinote debug_empty_midi_event = generateMidiEventFromVariables(0, 0, 0);
        Serial.printf("%u == %u \n", midinoteReturnTimePointer(&debug_empty_midi_event), midinoteReturnTimePointer(&empty_midi_note_generic));
        Serial.printf("%u == %u \n", midinoteReturnLength(&debug_empty_midi_event), midinoteReturnLength(&empty_midi_note_generic));
        Serial.printf("%u == %u \n", midinoteReturnMidiCode(&debug_empty_midi_event), midinoteReturnMidiCode(&empty_midi_note_generic));
        Serial.println("format debug = generic, any mismatches are bugs, end test1 \n");
            //test 2
        Serial.println("test2: initialising of playlist is correct (done in setup)");
        Serial.println("printing tree of data associated with runtimeAssets::playlist");
        Serial.println("==================\n");
        Serial.printf("bpm == %u, set at %u \n", playlistGetBPM, DEFAULT_BPM);
        Serial.printf("track length in beats == %u, set at 16 bars \n", playlistGetTrackLength());
        Serial.printf("playhead position should be 0 == %u \n", playlistGetPlayheadPosition());
        Serial.printf("subdivisions per sample is at %u \n", recalculateSamplesPerSubdivision(runtimeAssets::session_playlist.bpm));
        Serial.println("Playlist subchannel outputs: (should be at 0)");
        for (int track_iteration = 0; track_iteration < MAX_CHANNELS_OR_TRACKS; track_iteration++){
            upair32 subchannel_out = playlistGetSubchannelOutput(track_iteration);
            Serial.printf("|=>  track %u:   %u, %u\n", track_iteration, subchannel_out.int1, subchannel_out.int2);
        }
        Serial.println("Playlist Elapsed Midi times: (should DEFINITELY be at 0)");
        for (int track_iteration = 0; track_iteration < MAX_CHANNELS_OR_TRACKS; track_iteration++){
            Serial.printf("|=> track %u:    %u\n", track_iteration, playlistReturnElapsedTimeOnMidiEvent(track_iteration));
        } //all purely playlist variables run through, run through track variables now
        

