Shackle3/SAMPLETOY/SAMPLETOY_ESP32_Arduino/src/main.cpp
    }

     void mainTestChannelFunctionalities() {
        /*
        Tests that the channels, and their methods are implemented correctly with all the pointer bullshit i wrote in there.
        Mostly just editing and reading out of the memory
        */
        channel sub_channels[TOTAL_CHANNELS]; //legacy implementation, but useful for testing

        if (runtimeAssets::first_loop_iteration) {
            Serial.println("running tests on the implementation and functionality of SampletoyChannel.c/h");
            Serial.println("Beginning tests on functions:");
            delay(5000);
            //Assign increasing values for different channels using SET, then print it to terminal using GET. Sweep all channels
            int counter = 0;            
            for (Channel &channel_target : sub_channels){
                setChannelLevel(&channel_target, counter, counter + 1);
                counter = counter + 2;
                setChannelGain(&channel_target, counter);
                counter++;
                setChannelLR(&channel_target, counter);
                counter++;
                setChannelMS(&channel_target, counter);
                counter++;
                
            }
            //unique values on all channels
            int channel_counter = 1;
            for (Channel &this_channel : sub_channels){
                debug::DumpChannelData(&this_channel, channel_counter);
                channel_counter++;
            }
            //Reset
            for (Channel &this_channel : sub_channels){
                channelReinitialise(&this_channel);
            }
            channel_counter = 1;
            for (Channel &this_channel : sub_channels){
                debug::DumpChannelData(&this_channel, channel_counter);
                channel_counter++;
            }
            Serial.println("testing master in 5 seconds...");
            delay(5000);
            //run same test on Master
            masterSetLevel(&runtimeAssets::session_master_channel, counter * 10, (counter + 1) * 10);
            counter = counter + 2;
            Serial.println("intermediate test on setlevel");
            debug::DumpMasterData(&runtimeAssets::session_master_channel);
            //testing first of the two add to level functions
            masterResetLevelToMiddle(&runtimeAssets::session_master_channel);
            masterAddSignalToLevelLeft(&runtimeAssets::session_master_channel, counter);
            counter++;
            masterAddSignalToLevelRight(&runtimeAssets::session_master_channel, counter);
            counter++;
            masterSetGain(&runtimeAssets::session_master_channel, counter);
            counter++;
            masterSetPrescale(&runtimeAssets::session_master_channel, counter);
            counter++;
            masterSetMS(&runtimeAssets::session_master_channel, counter);
            counter++;
            debug::DumpMasterData(&runtimeAssets::session_master_channel);
            //reset, check reset is correct
            masterChannelReinitialise(&runtimeAssets::session_master_channel);
            debug::DumpMasterData(&runtimeAssets::session_master_channel);
        }
    }

    void mainTestPutSineMidiOntoTracks(){
        //set all tracks to sine generators
        for (track target : runtimeAssets::session_playlist.playlist_tracks){
            target.track_generator.generator_type = MATHSYNTH;
            target.track_generator.define_wave = SINE;
        }
        uint16_t note_interval = 1;
        //add midi note on specific harmonic, interval is 2 piano notes

        for (int target_index; target_index < TOTAL_CHANNELS; target_index++){
            uint8_t midi_entry = 23 + 2*note_interval;
            midinote new_event_container = generateMidiEventFromVariables(0, 187, midi_entry);//rougly 5 second long sine wave
            Serial.printf("checking new note is defined, %u, %u, %f, %u\n", new_event_container.length, new_event_container.midi_code, new_event_container.phase_position, new_event_container.point_to);
            runtimeAssets::session_playlist.playlist_tracks[target_index].track_midi.midi_note_array[0] = new_event_container;
            note_interval++;
            Serial.printf("ensuring note added to array, %u, %u\n", 
                runtimeAssets::session_playlist.playlist_tracks[target_index].track_midi.midi_note_array[0].length, 
                runtimeAssets::session_playlist.playlist_tracks[target_index].track_midi.midi_note_array[0].midi_code);
        }

    }

    void mainTestGenerationIntoDacPipeline(){
        clock_t debug_start = clock();

    }

    void IRAM_ATTR mainTestInterruptFunctionality(){
        runtimeAssets::temp_in_use = true;
        runtimeAssets::temp_generic++;
        // Serial.printf("button pressed %u times... \n" , temp_generic); ILLEGAL, interrupt cannot output to serial
        // probably do to its memory allocation :/
        debug::interrupt_reported = true;
    }
}

//generic debug operations
namespace debug {
    void DumpChannelData(const Channel *target, uint8_t channel_number) {
        Serial.println("DEBUG:::dumping channel information for channel:");
        Serial.println(channel_number);
        Serial.println("in format L, R, ms, g, lrp");
        Serial.println(channelGetLevelLeft(target));
        Serial.println(channelGetLevelRight(target));
        Serial.println(channelGetMonoSide(target));
        Serial.println(channelGetGain(target));
        Serial.println(channelGetLR(target));
    }

    void DumpMasterData(MasterChannel *target) {
        Serial.println("DEBUG:::dumping master information");
        Serial.println("in format L, R, g, pre, ms");
        Serial.println(masterGetLevelLeft(target));
        Serial.println(masterGetLevelRight(target));
        Serial.println(masterGetGain(target));
        Serial.println(masterGetPrescale(target));
        Serial.println(masterGetMS(target));
    }

    void debugGenerateNextSamplesForSubdivision(){ //subdivision level call
        //KEY DIFFERENCE, THIS ONE REPORTS GENERATIONS TO CONSOLE, DOES NOT PUSH TO DAC
        //!IMPORTANT should be called in loop() to batch generate samples for current playhead position, dont use the other sub functions called in this one
        uint32_t generating_sample_number = 0;
            //PRELOOP: global over all n calculations called here
        for (track track_target : runtimeAssets::session_playlist.playlist_tracks){
            printf("double checking that the midi is in the track, %u, %u\n", track_target.track_midi.midi_note_array[0].length, track_target.track_midi.midi_note_array[0].midi_code);
            trackUpdateActiveMidiEvents(&track_target.track_midi);
            printf("ensuring the update to active push is correct, %u, %u\n", track_target.track_midi.active_midi_events[0].length, track_target.track_midi.active_midi_events[0].midi_code);
        }
        //generate current active midi events for the subdivision
        //define samples to generate
        int n_samples_to_generate = recalculateSamplesPerSubdivision(playlistGetBPM());
        while(generating_sample_number < n_samples_to_generate){ //enter the generate loop over n number of samples
            debug::debugGenerateSampleOntoMasterImplicit();
            //printf("%u, %u, %u\n", generating_sample_number, runtimeAssets::dac_port.int1, runtimeAssets::dac_port.int2);
            generating_sample_number++;
        }
        runtimeAssets::session_playlist.playhead_position_subdivision++;
    }

