Shackle3/SAMPLETOY/SAMPLETOY_ESP32_Arduino/src/main.cpp
    void debugGenerateSampleOntoMasterImplicit(){ //should NOT be called in main loop, but instead be called by above function (generateNextSamples...)
        //See documentation page @todo
        //DOES NOT OUTPUT ONTO DAC, OUTPUTS INTO TERMINAL
        //1. Reset Master bus level
        masterResetLevelToMiddle(&runtimeAssets::session_master_channel);
        //2. sample number n is implicitly contained in metadata, call generate onto every track
        for (track track_instance : runtimeAssets::session_playlist.playlist_tracks){
            //call generate onto all tracks for that sample
            PlayFunctions::generateTrackSamples(&track_instance);            
        }
        //all channels contain audio information, summarising on array (2.iii)
        for (uint8_t i; i < TOTAL_CHANNELS; i++){
            //Serial.printf("attempting to find why my channel output is 0: merging values from tracks with %u, %u \n", runtimeAssets::session_playlist.playlist_tracks[i].track_channel.level_left, runtimeAssets::session_playlist.playlist_tracks[i].track_channel.level_right);
            runtimeAssets::session_playlist.subchannel_sample_outputs[i] = (upair32){
            runtimeAssets::session_playlist.playlist_tracks[i].track_channel.level_left, 
            runtimeAssets::session_playlist.playlist_tracks[i].track_channel.level_right
            };
        }
        //3. Sum channel to master
        for (upair32 channel_output : playlist_instance->subchannel_sample_outputs){
            //Serial.printf("debug channel output going to add onto master: %u, %u; \n", channel_output.int1, channel_output.int2);
            masterAddSignalPair(&runtimeAssets::session_master_channel, channel_output);
        }
        //From here, master is finished calculating
        //add into buffer
        uint16_t temp_left_16bit = downscale_int32_to_int16(runtimeAssets::session_master_channel.level_left);
        uint16_t temp_right_16bit = downscale_int32_to_int16(runtimeAssets::session_master_channel.level_right);
        runtimeAssets::dac_port = (upair16){temp_left_16bit, temp_right_16bit};
    }
}
